// 2차원 차이 배열 만들기
// create 2D difference array
// 크기가 n*m인 2차원 배열 d[][]에 대해
// k개의 구간 [(x1, y1), (x2, y2)] 와 u를 입력 받아,
// d[x1][y1] = d[x1][y1]+u;
// d[x2+1][y2+1] = d[x2+1][y2+1]+u;
// d[x1][y2+1] = d[x1][y2+1]-u;
// d[x2+1][y1] = d[x2+1][y1]-u;
// 를 수행한 후, 누적 합을 만들어 출력해보자.
// 크기가 7*7이고, 4개의 구간 데이터
// 1 1 2 2 1
// 2 2 3 3 1
// 3 3 4 4 1
// 4 4 5 5 1 가 입력되면
// 2차원 배열의 상태는
// 1 0 -1 0 0 0 0
// 0 1 0 -1 0 0 0
// -1 0 2 0 -1 0 0
// 0 -1 0 2 0 -1 0
// 0 0 -1 0 1 0 0
// 0 0 0 -1 0 1 0
// 0 0 0 0 0 0 0 가 되며
// 그 누적합을 계산하면 아래와 같다.
// 1 1 0 0 0 0 0
// 1 2 1 0 0 0 0
// 0 1 2 1 0 0 0
// 0 0 1 2 1 0 0
// 0 0 0 1 1 0 0
// 0 0 0 0 0 0 0
// 0 0 0 0 0 0 0
# include <iostream>
int i,j,n,m,k,x1,y1,x2,y2,u,a[1010]={},d[1010][1010]={},s[1010][1010]={};
int main(){
    scanf("%d %d %d",&n,&m,&k);
    for(i=1;i<=k;i++){
        scanf("%d %d %d %d %d",&x1,&y1,&x2,&y2,&u);
        d[x1][y1]+=u;
        d[x2+1][y2+1]+=u;
        d[x1][y2+1]-=u;
        d[x2+1][y1]-=u;
    }
    for(i=1;i<=n;i++){
        for(j=1;j<=m;j++)
            printf("%d ",d[i][j]);
        printf("\n");
    }
    for(i=1;i<=n;i++){
        for(j=1;j<=m;j++){
            a[j]+=d[i][j];
            s[i][j]=j==1?a[j]:s[i][j-1]+a[j];
        }   
    }
    for(i=1;i<=n;i++){
        for(j=1;j<=m;j++)
            printf("%d ",s[i][j]);
        printf("\n");
    }
}